/*
 * Copyright 2008 - 2015 Freescale Semiconductor Inc.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *	 notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *	 notice, this list of conditions and the following disclaimer in the
 *	 documentation and/or other materials provided with the distribution.
 *     * Neither the name of Freescale Semiconductor nor the
 *	 names of its contributors may be used to endorse or promote products
 *	 derived from this software without specific prior written permission.
 *
 * ALTERNATIVELY, this software may be distributed under the terms of the
 * GNU General Public License ("GPL") as published by the Free Software
 * Foundation, either version 2 of that License or (at your option) any
 * later version.
 *
 * THIS SOFTWARE IS PROVIDED BY Freescale Semiconductor ``AS IS'' AND ANY
 * EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL Freescale Semiconductor BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;

#define MACCFG1_TX_FLOW		0x00000010
#define MACCFG1_TX_EN		0x00000001
#define MACCFG1_RX_EN		0x00000004

#define MACCFG2_NIBBLE_MODE		0x00000100
#define MACCFG2_BYTE_MODE		0x00000200
#define MACCFG2_PRE_AM_RX_EN		0x00000080
#define MACCFG2_PRE_AM_TX_EN		0x00000040
#define MACCFG2_LENGTH_CHECK		0x00000010
#define MACCFG2_MAGIC_PACKET_EN	0x00000008
#define MACCFG2_PAD_CRC_EN		0x00000004
#define MACCFG2_CRC_EN			0x00000002
#define MACCFG2_FULL_DUPLEX		0x00000001
#define MACCFG2_PREAMBLE_LENGTH_MASK	0x0000f000
#define MACCFG2_PREAMBLE_LENGTH_SHIFT	12

#define IPGIFG_NON_BACK_TO_BACK_IPG_1_SHIFT	24
#define IPGIFG_NON_BACK_TO_BACK_IPG_2_SHIFT	16
#define IPGIFG_MIN_IFG_ENFORCEMENT_SHIFT	8

#define IPGIFG_NON_BACK_TO_BACK_IPG_1	0x7F000000
#define IPGIFG_NON_BACK_TO_BACK_IPG_2	0x007F0000
#define IPGIFG_MIN_IFG_ENFORCEMENT	0x0000FF00
#define IPGIFG_BACK_TO_BACK_IPG		0x0000007F

#define HAFDUP_ALT_BEB				0x00080000
#define HAFDUP_BP_NO_BACKOFF			0x00040000
#define HAFDUP_NO_BACKOFF			0x00020000
#define HAFDUP_EXCESS_DEFER			0x00010000
#define HAFDUP_COLLISION_WINDOW		0x000003ff
#define HAFDUP_ALTERNATE_BEB_TRUNCATION_MASK	0x00f00000
#define HAFDUP_ALTERNATE_BEB_TRUNCATION_SHIFT	20
#define HAFDUP_RETRANSMISSION_MAX_SHIFT	12
#define HAFDUP_RETRANSMISSION_MAX		0x0000f000

#define NUM_OF_HASH_REGS	8	/* Number of hash table registers */

#define PTV_PTE_MASK		0xffff0000
#define PTV_PT_MASK		0x0000ffff
#define PTV_PTE_SHIFT		16

/* CAR1/2 bits */
#define DTSEC_CAR1_TR64		0x80000000
#define DTSEC_CAR1_TR127	0x40000000
#define DTSEC_CAR1_TR255	0x20000000
#define DTSEC_CAR1_TR511	0x10000000
#define DTSEC_CAR1_TRK1		0x08000000
#define DTSEC_CAR1_TRMAX	0x04000000
#define DTSEC_CAR1_TRMGV	0x02000000

#define DTSEC_CAR1_RBYT		0x00010000
#define DTSEC_CAR1_RPKT		0x00008000
#define DTSEC_CAR1_RFCS		0x00004000
#define DTSEC_CAR1_RMCA		0x00002000
#define DTSEC_CAR1_RBCA		0x00001000
#define DTSEC_CAR1_RXCF		0x00000800
#define DTSEC_CAR1_RXPF		0x00000400
#define DTSEC_CAR1_RXUO		0x00000200
#define DTSEC_CAR1_RALN		0x00000100
#define DTSEC_CAR1_RFLR		0x00000080
#define DTSEC_CAR1_RCDE		0x00000040
#define DTSEC_CAR1_RCSE		0x00000020
#define DTSEC_CAR1_RUND		0x00000010
#define DTSEC_CAR1_ROVR		0x00000008
#define DTSEC_CAR1_RFRG		0x00000004
#define DTSEC_CAR1_RJBR		0x00000002
#define DTSEC_CAR1_RDRP		0x00000001

#define DTSEC_CAR2_TJBR		0x00080000
#define DTSEC_CAR2_TFCS		0x00040000
#define DTSEC_CAR2_TXCF		0x00020000
#define DTSEC_CAR2_TOVR		0x00010000
#define DTSEC_CAR2_TUND		0x00008000
#define DTSEC_CAR2_TFRG		0x00004000
#define DTSEC_CAR2_TBYT		0x00002000
#define DTSEC_CAR2_TPKT		0x00001000
#define DTSEC_CAR2_TMCA		0x00000800
#define DTSEC_CAR2_TBCA		0x00000400
#define DTSEC_CAR2_TXPF		0x00000200
#define DTSEC_CAR2_TDFR		0x00000100
#define DTSEC_CAR2_TEDF		0x00000080
#define DTSEC_CAR2_TSCL		0x00000040
#define DTSEC_CAR2_TMCL		0x00000020
#define DTSEC_CAR2_TLCL		0x00000010
#define DTSEC_CAR2_TXCL		0x00000008
#define DTSEC_CAR2_TNCL		0x00000004
#define DTSEC_CAR2_TDRP		0x00000001

/* memory map */
struct dtsec_regs {
	/* dTSEC General Control and Status Registers */
	u32 tsec_id;		/* 0x000 ETSEC_ID register */
	u32 tsec_id2;		/* 0x004 ETSEC_ID2 register */
	u32 ievent;		/* 0x008 Interrupt event register */
	u32 imask;		/* 0x00C Interrupt mask register */
	u32 reserved0010[1];
	u32 ecntrl;		/* 0x014 E control register */
	u32 ptv;		/* 0x018 Pause time value register */
	u32 tbipa;		/* 0x01C TBI PHY address register */
	u32 tmr_ctrl;		/* 0x020 Time-stamp Control register */
	u32 tmr_pevent;		/* 0x024 Time-stamp event register */
	u32 tmr_pemask;		/* 0x028 Timer event mask register */
	u32 reserved002c[5];
	u32 tctrl;		/* 0x040 Transmit control register */
	u32 reserved0044[3];
	u32 rctrl;		/* 0x050 Receive control register */
	u32 reserved0054[11];
	u32 igaddr[8];		/* 0x080-0x09C Individual/group address */
	u32 gaddr[8];		/* 0x0A0-0x0BC Group address registers 0-7 */
	u32 reserved00c0[16];
	u32 maccfg1;		/* 0x100 MAC configuration #1 */
	u32 maccfg2;		/* 0x104 MAC configuration #2 */
	u32 ipgifg;		/* 0x108 IPG/IFG */
	u32 hafdup;		/* 0x10C Half-duplex */
	u32 maxfrm;		/* 0x110 Maximum frame */
	u32 reserved0114[10];
	u32 ifstat;		/* 0x13C Interface status */
	u32 macstnaddr1;	/* 0x140 Station Address,part 1 */
	u32 macstnaddr2;	/* 0x144 Station Address,part 2 */
	struct {
		u32 exact_match1;	/* octets 1-4 */
		u32 exact_match2;	/* octets 5-6 */
	} macaddr[15];		/* 0x148-0x1BC mac exact match addresses 1-15 */
	u32 reserved01c0[16];
	u32 tr64;	/* 0x200 Tx and Rx 64 byte frame counter */
	u32 tr127;	/* 0x204 Tx and Rx 65 to 127 byte frame counter */
	u32 tr255;	/* 0x208 Tx and Rx 128 to 255 byte frame counter */
	u32 tr511;	/* 0x20C Tx and Rx 256 to 511 byte frame counter */
	u32 tr1k;	/* 0x210 Tx and Rx 512 to 1023 byte frame counter */
	u32 trmax;	/* 0x214 Tx and Rx 1024 to 1518 byte frame counter */
	u32 trmgv;
	/* 0x218 Tx and Rx 1519 to 1522 byte good VLAN frame count */
	u32 rbyt;	/* 0x21C receive byte counter */
	u32 rpkt;	/* 0x220 receive packet counter */
	u32 rfcs;	/* 0x224 receive FCS error counter */
	u32 rmca;	/* 0x228 RMCA Rx multicast packet counter */
	u32 rbca;	/* 0x22C Rx broadcast packet counter */
	u32 rxcf;	/* 0x230 Rx control frame packet counter */
	u32 rxpf;	/* 0x234 Rx pause frame packet counter */
	u32 rxuo;	/* 0x238 Rx unknown OP code counter */
	u32 raln;	/* 0x23C Rx alignment error counter */
	u32 rflr;	/* 0x240 Rx frame length error counter */
	u32 rcde;	/* 0x244 Rx code error counter */
	u32 rcse;	/* 0x248 Rx carrier sense error counter */
	u32 rund;	/* 0x24C Rx undersize packet counter */
	u32 rovr;	/* 0x250 Rx oversize packet counter */
	u32 rfrg;	/* 0x254 Rx fragments counter */
	u32 rjbr;	/* 0x258 Rx jabber counter */
	u32 rdrp;	/* 0x25C Rx drop */
	u32 tbyt;	/* 0x260 Tx byte counter */
	u32 tpkt;	/* 0x264 Tx packet counter */
	u32 tmca;	/* 0x268 Tx multicast packet counter */
	u32 tbca;	/* 0x26C Tx broadcast packet counter */
	u32 txpf;	/* 0x270 Tx pause control frame counter */
	u32 tdfr;	/* 0x274 Tx deferral packet counter */
	u32 tedf;	/* 0x278 Tx excessive deferral packet counter */
	u32 tscl;	/* 0x27C Tx single collision packet counter */
	u32 tmcl;	/* 0x280 Tx multiple collision packet counter */
	u32 tlcl;	/* 0x284 Tx late collision packet counter */
	u32 txcl;	/* 0x288 Tx excessive collision packet counter */
	u32 tncl;	/* 0x28C Tx total collision counter */
	u32 reserved0290[1];
	u32 tdrp;	/* 0x294 Tx drop frame counter */
	u32 tjbr;	/* 0x298 Tx jabber frame counter */
	u32 tfcs;	/* 0x29C Tx FCS error counter */
	u32 txcf;	/* 0x2A0 Tx control frame counter */
	u32 tovr;	/* 0x2A4 Tx oversize frame counter */
	u32 tund;	/* 0x2A8 Tx undersize frame counter */
	u32 tfrg;	/* 0x2AC Tx fragments frame counter */
	u32 car1;	/* 0x2B0 carry register one register* */
	u32 car2;	/* 0x2B4 carry register two register* */
	u32 cam1;	/* 0x2B8 carry register one mask register */
	u32 cam2;	/* 0x2BC carry register two mask register */
	u32 reserved02c0[848];
};

/* struct dtsec_cfg - dTSEC configuration
 * Transmit half-duplex flow control, under software
 * control for 10/100-Mbps half-duplex media. If set,
 * back pressure is applied to media by raising carrier.
 * halfdup_retransmit:
 * Number of retransmission attempts following a collision.
 * If this is exceeded dTSEC aborts transmission due to
 * excessive collisions. The standard specifies the
 * attempt limit to be 15.
 * halfdup_coll_window:
 * The number of bytes of the frame during which
 * collisions may occur. The default value of 55
 * corresponds to the frame byte at the end of the
 * standard 512-bit slot time window. If collisions are
 * detected after this byte, the late collision event is
 * asserted and transmission of current frame is aborted.
 * rx_drop_bcast:
 * Discard broadcast frames. If set, all broadcast frames
 * will be discarded by dTSEC.
 * rx_short_frm:
